rorke-time/experiment1-sriov-rorke-time/rorke400-memtier-250k.txt
Executing: memtier_benchmark -h 128.110.218.200 -p 11211 --ratio=1:10 --test-time=30 --rate-limiting=1250 -t 8 -c 25 --key-pattern=P:P --key-maximum 1000000 -P memcache_text
8         Threads
25        Connections per thread
30        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        19960.14          ---          ---         0.79403         0.81500         2.73500         5.27900      1342.81 
Gets       199567.86     78580.77    120987.09         0.78413         0.81500         2.68700         5.18300      9523.37 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     219528.00     78580.77    120987.09         0.78503         0.81500         2.68700         5.21500     10866.19 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.039        0.000
SET       0.103        5.000
SET       0.143       10.000
SET       0.191       15.000
SET       0.335       20.000
SET       0.623       25.000
SET       0.679       30.000
SET       0.735       35.000
SET       0.767       40.000
SET       0.799       45.000
SET       0.815       50.000
SET       0.823       52.500
SET       0.831       55.000
SET       0.839       57.500
SET       0.839       60.000
SET       0.847       62.500
SET       0.855       65.000
SET       0.863       67.500
SET       0.871       70.000
SET       0.879       72.500
SET       0.887       75.000
SET       0.887       76.250
SET       0.895       77.500
SET       0.903       78.750
SET       0.911       80.000
SET       0.919       81.250
SET       0.935       82.500
SET       0.943       83.750
SET       0.959       85.000
SET       0.983       86.250
SET       1.015       87.500
SET       1.039       88.125
SET       1.071       88.750
SET       1.127       89.375
SET       1.255       90.000
SET       1.415       90.625
SET       1.495       91.250
SET       1.543       91.875
SET       1.583       92.500
SET       1.615       93.125
SET       1.639       93.750
SET       1.655       94.062
SET       1.663       94.375
SET       1.679       94.688
SET       1.687       95.000
SET       1.703       95.312
SET       1.719       95.625
SET       1.735       95.938
SET       1.751       96.250
SET       1.775       96.562
SET       1.807       96.875
SET       1.831       97.031
SET       1.871       97.188
SET       1.935       97.344
SET       2.063       97.500
SET       2.255       97.656
SET       2.367       97.812
SET       2.415       97.969
SET       2.447       98.125
SET       2.495       98.281
SET       2.527       98.438
SET       2.543       98.516
SET       2.559       98.594
SET       2.575       98.672
SET       2.607       98.750
SET       2.623       98.828
SET       2.655       98.906
SET       2.719       98.984
SET       2.847       99.062
SET       3.087       99.141
SET       3.247       99.219
SET       3.279       99.258
SET       3.311       99.297
SET       3.343       99.336
SET       3.359       99.375
SET       3.391       99.414
SET       3.423       99.453
SET       3.455       99.492
SET       3.487       99.531
SET       3.567       99.570
SET       3.743       99.609
SET       3.903       99.629
SET       4.031       99.648
SET       4.127       99.668
SET       4.159       99.688
SET       4.191       99.707
SET       4.223       99.727
SET       4.255       99.746
SET       4.319       99.766
SET       4.383       99.785
SET       4.543       99.805
SET       4.703       99.814
SET       4.863       99.824
SET       4.927       99.834
SET       4.991       99.844
SET       5.023       99.854
SET       5.087       99.863
SET       5.119       99.873
SET       5.151       99.883
SET       5.215       99.893
SET       5.311       99.902
SET       5.407       99.907
SET       5.567       99.912
SET       5.759       99.917
SET       5.823       99.922
SET       5.887       99.927
SET       5.919       99.932
SET       5.983       99.937
SET       6.047       99.941
SET       6.143       99.946
SET       6.367       99.951
SET       6.559       99.954
SET       6.655       99.956
SET       6.719       99.958
SET       6.751       99.961
SET       6.815       99.963
SET       6.847       99.966
SET       6.911       99.968
SET       7.039       99.971
SET       7.295       99.973
SET       7.455       99.976
SET       7.487       99.977
SET       7.583       99.978
SET       7.583       99.979
SET       7.679       99.980
SET       7.711       99.982
SET       7.743       99.983
SET       7.871       99.984
SET       8.095       99.985
SET       8.319       99.987
SET       8.447       99.988
SET       8.447       99.988
SET       8.511       99.989
SET       8.511       99.990
SET       8.575       99.990
SET       8.575       99.991
SET       8.639       99.991
SET       8.767       99.992
SET       9.023       99.993
SET       9.151       99.993
SET       9.215       99.994
SET       9.279       99.994
SET       9.279       99.995
SET       9.279       99.995
SET       9.343       99.995
SET       9.343       99.995
SET       9.343       99.996
SET       9.343       99.996
SET       9.343       99.996
SET       9.343       99.997
SET       9.471       99.997
SET       9.471       99.997
SET       9.471       99.997
[...]
SET       9.471       99.998
SET       9.535       99.998
SET       9.535       99.998
SET       9.663       99.998
SET       9.919       99.998
SET       9.919       99.998
SET      10.047       99.998
SET      10.047       99.999
SET      10.047       99.999
SET      10.175       99.999
SET      10.175       99.999
SET      10.175       99.999
[...]
SET      10.239       99.999
SET      10.239       99.999
SET      10.239       99.999
SET      10.303       99.999
SET      10.303       99.999
SET      10.303       99.999
[...]
SET      10.303      100.000
SET      10.303      100.000
SET      10.303      100.000
[...]
SET      10.879      100.000
SET      10.879      100.000
SET      10.879      100.000
[...]
SET      11.455      100.000
SET      11.455      100.000
---
GET       0.031        0.000
GET       0.103        5.000
GET       0.143       10.000
GET       0.183       15.000
GET       0.303       20.000
GET       0.615       25.000
GET       0.679       30.000
GET       0.727       35.000
GET       0.767       40.000
GET       0.791       45.000
GET       0.815       50.000
GET       0.823       52.500
GET       0.823       55.000
GET       0.831       57.500
GET       0.839       60.000
GET       0.847       62.500
GET       0.855       65.000
GET       0.855       67.500
GET       0.863       70.000
GET       0.871       72.500
GET       0.879       75.000
GET       0.887       76.250
GET       0.895       77.500
GET       0.895       78.750
GET       0.903       80.000
GET       0.911       81.250
GET       0.927       82.500
GET       0.935       83.750
GET       0.951       85.000
GET       0.975       86.250
GET       0.999       87.500
GET       1.015       88.125
GET       1.039       88.750
GET       1.079       89.375
GET       1.151       90.000
GET       1.311       90.625
GET       1.455       91.250
GET       1.519       91.875
GET       1.559       92.500
GET       1.599       93.125
GET       1.631       93.750
GET       1.639       94.062
GET       1.655       94.375
GET       1.663       94.688
GET       1.679       95.000
GET       1.695       95.312
GET       1.703       95.625
GET       1.719       95.938
GET       1.735       96.250
GET       1.759       96.562
GET       1.791       96.875
GET       1.807       97.031
GET       1.831       97.188
GET       1.871       97.344
GET       1.935       97.500
GET       2.079       97.656
GET       2.287       97.812
GET       2.383       97.969
GET       2.431       98.125
GET       2.479       98.281
GET       2.511       98.438
GET       2.527       98.516
GET       2.543       98.594
GET       2.559       98.672
GET       2.575       98.750
GET       2.607       98.828
GET       2.639       98.906
GET       2.671       98.984
GET       2.735       99.062
GET       2.927       99.141
GET       3.199       99.219
GET       3.247       99.258
GET       3.279       99.297
GET       3.311       99.336
GET       3.343       99.375
GET       3.375       99.414
GET       3.391       99.453
GET       3.423       99.492
GET       3.471       99.531
GET       3.519       99.570
GET       3.599       99.609
GET       3.711       99.629
GET       3.871       99.648
GET       4.031       99.668
GET       4.127       99.688
GET       4.159       99.707
GET       4.191       99.727
GET       4.223       99.746
GET       4.287       99.766
GET       4.319       99.785
GET       4.383       99.805
GET       4.447       99.814
GET       4.543       99.824
GET       4.703       99.834
GET       4.863       99.844
GET       4.959       99.854
GET       5.023       99.863
GET       5.055       99.873
GET       5.087       99.883
GET       5.151       99.893
GET       5.215       99.902
GET       5.279       99.907
GET       5.343       99.912
GET       5.471       99.917
GET       5.695       99.922
GET       5.791       99.927
GET       5.855       99.932
GET       5.919       99.937
GET       5.951       99.941
GET       6.015       99.946
GET       6.079       99.951
GET       6.143       99.954
GET       6.303       99.956
GET       6.463       99.958
GET       6.591       99.961
GET       6.655       99.963
GET       6.719       99.966
GET       6.783       99.968
GET       6.815       99.971
GET       6.847       99.973
GET       6.943       99.976
GET       7.039       99.977
GET       7.199       99.978
GET       7.327       99.979
GET       7.455       99.980
GET       7.551       99.982
GET       7.583       99.983
GET       7.647       99.984
GET       7.679       99.985
GET       7.711       99.987
GET       7.775       99.988
GET       7.839       99.988
GET       7.935       99.989
GET       8.159       99.990
GET       8.319       99.990
GET       8.383       99.991
GET       8.447       99.991
GET       8.447       99.992
GET       8.511       99.993
GET       8.511       99.993
GET       8.575       99.994
GET       8.639       99.994
GET       8.703       99.995
GET       8.895       99.995
GET       8.959       99.995
GET       9.151       99.995
GET       9.215       99.996
GET       9.215       99.996
GET       9.279       99.996
GET       9.279       99.997
GET       9.343       99.997
GET       9.343       99.997
GET       9.343       99.997
[...]
GET       9.407       99.998
GET       9.407       99.998
GET       9.407       99.998
GET       9.471       99.998
GET       9.471       99.998
GET       9.535       99.998
GET       9.663       99.998
GET       9.727       99.999
GET       9.727       99.999
GET       9.791       99.999
GET       9.919       99.999
GET       9.983       99.999
GET      10.047       99.999
GET      10.111       99.999
GET      10.111       99.999
GET      10.111       99.999
[...]
GET      10.175       99.999
GET      10.175       99.999
GET      10.175       99.999
[...]
GET      10.175      100.000
GET      10.175      100.000
GET      10.175      100.000
GET      10.239      100.000
GET      10.239      100.000
GET      10.239      100.000
[...]
GET      10.303      100.000
GET      10.303      100.000
GET      10.303      100.000
[...]
GET      10.367      100.000
GET      10.367      100.000
GET      10.495      100.000
GET      10.687      100.000
GET      10.687      100.000
GET      10.815      100.000
GET      10.815      100.000
GET      10.879      100.000
GET      10.879      100.000
GET      10.879      100.000
[...]
GET      10.943      100.000
GET      10.943      100.000
GET      10.943      100.000
[...]
GET      12.287      100.000
GET      12.287      100.000
GET      12.287      100.000
[...]
GET      12.351      100.000
GET      12.351      100.000
---
WAIT      0.000      100.000